validations/SSTHB/HB10/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel HerschelBulkley;
HerschelBulkleyCoeffs
{
    nu0      [ 0 2 -1 0 0 0 0 ] 1e-3;
    tau0     [ 0 2 -2 0 0 0 0 ] 6.656396367541316e-08;
    k        [ 0 2 -1 0 0 0 0 ] 1e-06;  // the dimension does not need to be changed. The solver handles it.
    n        [ 0 0  0 0 0 0 0 ] 0.8;
}

// ************************************************************************* //
