validations/SSTHB/HB10/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "280000";
    object      nu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
38500
(
2.31196e-05
2.39573e-05
2.4244e-05
2.46676e-05
2.51618e-05
2.5697e-05
2.62613e-05
2.68486e-05
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1.26229e-06
1.26234e-06
1.26241e-06
1.26248e-06
1.26256e-06
1.26264e-06
1.26272e-06
1.26279e-06
...
)
;
    }
}


// ************************************************************************* //
