validations/SSTHB/HB10/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "280000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
76900
(
-2.88599e-23
-5.57709e-23
4.18262e-23
6.65187e-23
-2.96842e-23
-5.43136e-23
5.89512e-23
-1.02598e-23
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
38500
(
2.55672e-07
2.55842e-07
2.55996e-07
2.5614e-07
2.56276e-07
2.56402e-07
2.56521e-07
2.56632e-07
...
)
;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
38500
(
-2.55672e-07
-2.55842e-07
-2.55996e-07
-2.5614e-07
-2.56276e-07
-2.56402e-07
-2.56521e-07
-2.56632e-07
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
