validations/SSTHB/HB10/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.05;
        smoother        DIC;
    }

    k
    {
        solver          smoothSolver;
        tolerance       1e-08;
        relTol          0.05;
        smoother        symGaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.05;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    pRefCell  0;
    pRefValue 0;
}

relaxationFactors
{
    equations
    {
        p               0.95; // 0.9 is more stable but 0.95 more convergent
        ".*"            0.95; // 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
